// ** неявное преобразование к number, унарные +/-. Момент с конкатенацией
'2' - '2'; // НЕявно, 0 - ноль
Number('2') - Number('2'); // явно, 0 - ноль

'4' / 'два'; // NaN, т.к. 'два' не число.. 4/NaN = NaN

+'42'; // 42
-'42'; // -42
-'сорок два'; // NaN

true / false; // infinity, т.к. 1 / 0
false * true; // 0, т.к. 0 * 1

'100500' ** false; // 1, т.к. 1 в степени 0 = 1

'4' + 2; // '42' - строка, т.к. конкатенация
4 + '2'; // '42' - строка, тот же результат

42 + {}; // ! '42[object Object]' - строка
42 + [1, 2, 3]; // ! '421,2,3' - строка

42 + 10 + '15' + true;
// 1. 42 + 10 = 52
// 2. 52 + '15' = '5215'
// 3. '5215' + true = '5215true'
