let a = 10 + 5;
let b = 10 - 5;
let c = 10 * 5;
let d = 10 / 5;
// взятие остатка (или остаток от деления)
let e = 10 % 3; // => 1

let complex = 10 + 5 * 10 - 8 / 2; // => 56
let complex2 = ((10 + 5) * (10 - 8)) / 2; // => 15

// инкремент/декремент (префиксная запись)
let i = 10;
i++; // => 11
i--; // => 10
++i; // => 11
--i; // => 10

console.log(i); // => 10
console.log(i++); // снова => 10
console.log(i); // а вот теперь => 11

console.log(i--); // => 11
console.log(i); // => 10

// операции с присвоением
console.log(a); // => 15
a += 5; // то-же самое, что a = a + 5; => 20
a -= 15;
a *= 2;
a /= 5;
a %= 1;
